<html>
  <head>
    <meta charset="UTF-8">

    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/materialize/0.97.7/css/materialize.min.css">
    <link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
    <link href="style.css" rel="stylesheet">

    <script src="https://code.jquery.com/jquery-3.1.1.min.js" integrity="sha256-hVVnYaiADRTO2PzUGmuLJr8BLUSjGIZsDYGmIJLv2b8=" crossorigin="anonymous"></script>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/materialize/0.97.7/js/materialize.min.js"></script>
    <script src="http://www.w3schools.com/lib/w3data.js"></script>

    <title>Home Page</title>
  </head>
  <body>
    <!-- NAVBAR -->
    <ul id="dropdown-admin" class="dropdown-content">
      <li><a href="config.html">Configurações Gerais</a></li>
      <li class="divider"></li>
      <li><a href="calibracao_config">Calibração do Sensor</a></li>
    </ul>

    <ul id="dropdown-manuais" class="dropdown-content">
      <li><a href="#">Guia Completo</a></li>
      <li class="divider"></li>
      <li><a href="#">Limpeza do veículo</a></li>
      <li><a href="#"></a></li>
    </ul>

    <nav>
      <div class="nav-wrapper">
        <a href="index.html" class="brand-logo">Logo</a>
        <ul class="right hide-on-med-and-down">
          <li><a class="dropdown-button" href="#!" data-activates="dropdown-admin">Administração<i class="material-icons right">arrow_drop_down</i></a></li>
          <li><a href="pagina_medicoes.html">Minhas Medições</a></li>
          <li><a class="dropdown-button" href="#!" data-activates="dropdown-manuais">Manuais<i class="material-icons right">arrow_drop_down</i></a></li>
        </ul>
      </div>
    </nav>
    <!-- END NAVBAR -->

    <!-- 
      ============= DIFF =========
      * Este é o conteúdo que caracteriza a página de configurações do host
      a ser conectado. Gostaria que fosse tudo com AJAX.

     -->
    <div class="content general-config col s12">
      <h4>
        <i class='material-icons prefix'>import contacts</i>
        <span>Manual de utilização</span>
      </h4>
      <div class="row description">
        <form class="col s12">
          <p>Esse sistema &eacute; serve para a ger&ecirc;ncia do estado de sua planta&ccedil;&atilde;o e configua&ccedil;&atilde;o do carro aut&ocirc;nomo para monitoramento de sua planta&ccedil;&atilde;o de morango.</p>
          <p>Ao acessar o sistema voc&ecirc; ir&aacute; se deparar com a p&aacute;gina inicial onde ter&aacute; quatro op&ccedil;&otilde;es e uma a&ccedil;&atilde;o, sendo que uma das quatro op&ccedil;&otilde;es &eacute; o manual que aqui se encontra.</p>
          <p><strong>Configura&ccedil;&atilde;o Gerais</strong></p>
          <p>A primeira op&ccedil;&atilde;o "Configura&ccedil;&otilde;es Gerais", voc&ecirc; ir&aacute; se deparar com a op&ccedil;&atilde;o de baixar os dados para que voc&ecirc; obtenha as informa&ccedil;&otilde;es coletadas pelo carro e tamb&eacute;m que voc&ecirc; possa recuperar as medi&ccedil;&otilde;es feitas pelo ve&iacute;culo, se de alguma forma ocorrer perca dos dados do seu sistema, com essa op&ccedil;&atilde;o voc&ecirc; recuperar esses dados do carro aut&ocirc;nomo.</p>
          <p>A outra op&ccedil;&atilde;o voc&ecirc; dever&aacute; antes de colocar o carro para trabalhar monitorando o campo, incluir as informa&ccedil;&otilde;es relacionado a quantidade de fileiras ou cramalh&otilde;es de sua planta&ccedil;&atilde;o, para que o carro saiba quantas fileiras deve percorrer e quando deve ser sua parada.</p>
          <p>A outra op&ccedil;&atilde;o &eacute; relacionada a configura&ccedil;&atilde;o de acesso ao carro aut&ocirc;nomo, baseado nessa confogura&ccedil;&atilde;o que ele consefuir&aacute; mandar os dados que o mesmo precisa. A princ&iacute;pio essa op&ccedil;&atilde;o j&aacute; vem configurada, n&atilde;o precisando alter&aacute;-la, a n&atilde;o ser que voc&ecirc; necessite alterar o endere&ccedil;o de acesso ao carro.</p>
          <p><strong>Minhas Medi&ccedil;&otilde;es</strong></p>
          <p>A segunda op&ccedil;&atilde;o "Minhas Medi&ccedil;&otilde;es" voc&ecirc; poder&aacute; obter as informa&ccedil;&otilde;es coletadas pelo carro e com base neles, realizar a ger&ecirc;ncia de sua planta&ccedil;&atilde;o. Para que os dados apare&ccedil;am, &eacute; necess&aacute;rio antes baixar as informa&ccedil;&otilde;es na op&ccedil;&atilde;o de configura&ccedil;&otilde;es gerais, e j&aacute; na op&ccedil;&atilde;o Minha Medi&ccedil;&otilde;es, clicar no bot&atilde;o "Ler" para que o sistema leia os dados obtidos do carro e traga as informa&ccedil;&otilde;es. Aqui voc&ecirc; poder&aacute; verificar os dados principais que s&atilde;o umidade do solo, umidade do ar e temperatura do ar. Como observa&ccedil;&atilde;o a umidade do solo ideal para planta&ccedil;&otilde;es de morango deve estar entre 20% e 21%.</p>
          <p><strong>Calibra&ccedil;&atilde;o do sensor</strong></p>
          <p>A terceira op&ccedil;&atilde;o "Calibra&ccedil;&atilde;o do sensor" &eacute; onde voc&ecirc; ter&aacute; que antes de colocar o carro em a&ccedil;&atilde;o para monitora&ccedil;&atilde;o, calibrar o sensor de umidade do solo do carro, pois caso n&atilde;o seja calibrado, os dados de umidade do seu solo, vir&atilde;o incorretas, e isso pode acarretar preju&iacute;zo a sua planta&ccedil;&atilde;o. Para calibra&ccedil;&atilde;o, ser&aacute; necess&aacute;rio seguir os seguintes passos:</p>
          <ol>
            <li>Pegar uma amostra do seu solo com peso aproximado de 100 gramas.</li>
            <li>Fazer a secagem desta amostra com aux&iacute;lio do microondas com pot&ecirc;ncia entre 60% a 80%.</li>
            <li>Esperar o tempo de 240 segundos ou 4 minutos exatos para estabiliza&ccedil;&atilde;o da massa do solo.</li>
            <li>Pesar a amostra de solo seco e verificar se o mesmo est&aacute; com 100 gramas.</li>
            <li>Caso d&ecirc; um valor acima, retirar o excesso at&eacute; atingir o valor de 100 gramas, caso n&atilde;o atinja esse valor, ser&aacute; necess&aacute;rio completar a amostra e repetir o processo de secagem.</li>
            <li>Pegar uma amostra de &aacute;gua destilada com peso de 5 gramas e umedecer a amostra.</li>
            <li>Misturar bem a amostra at&eacute; obter uma amostra homog&ecirc;nea.</li>
            <li>Realizar a medi&ccedil;&atilde;o dessa amostra com o sensor de umidade e obter o valor.</li>
            <li>Os valores dos pesos do solo e da &aacute;gua passados s&atilde;o intencionais, pois com estes valores, dar&aacute; um valor de umidade de 5%.</li>
            <li>O valor obtido da medida do sensor com o valor da umidade a 5% indicar&aacute; que para esta umidade o valor da medida do sensor &eacute; equivalente.</li>
            <li>Repetir esse procedimento para amostra de solo com 10%, 15%, 20%, 25%, 30%, 40%, 50% e 60%, sendo estas porcentagens equivalentes ao valor do peso da &aacute;gua, e incluir esses valoes no sistema na parte de calibra&ccedil;&atilde;o do sistema.</li>
          </ol>
          <p><strong>Iniciar Medi&ccedil;&otilde;es</strong></p>
          <p>O bot&atilde;o "Iniciar Medi&ccedil;&otilde;es"&nbsp;ir&aacute; iniciar o carro depois de coloc&aacute;-lo no ponto inicial para que ele realize as medi&ccedil;&otilde;es em sua planta&ccedil;&atilde;o.</p>
          <p>&nbsp;</p>
        </form>
      </div>
    </div>
    

    <!-- ============= DIFF ======================= --> 
  <body>
</html>
          
